app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<h2>Comments</h2>
<% @article.comments.each do |comment| %>
  <% @user = User.find_by_id(comment.user_id) %>