app/views/users/show.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = 1
---
	<div class = "span4">
	  <% if @user.articles.any? %>