app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = 1
---
<span>
  <%= pluralize(current_user.articles.count, "article") %>