app/controllers/articles_controller.rb

  def index
    @articles = Article.find :all, :order => 'id ASC'
---
SELECT "articles".* FROM "articles" ORDER BY articles.created_at DESC, id ASC

  def create
    @article = current_user.articles.build(params[:article])
    if @article.save
---
INSERT INTO "articles" ("author", "content", "created_at", "teaser", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
   @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY articles.created_at DESC LIMIT 1  [["id", "1"]]