app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY articles.created_at DESC LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("article_id", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "comment"], ["created_at", Thu, 25 Jul 2013 03:50:31 UTC +00:00], ["updated_at", Thu, 25 Jul 2013 03:50:31 UTC +00:00], ["user_id", 1]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(params[:comment])
    @comment = current_user.comments.build(params[:comment])
 	@comment.article = @article
 	@comment.user = current_user

    respond_to do |format|
      if @comment.save