app/controllers/messages_controller.rb

INSERT INTO "messages" ("author_id", "created_at", "html", "room_id", "text", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", 1], ["created_at", Tue, 30 Jul 2013 16:48:19 UTC +00:00], ["html", nil], ["room_id", 1], ["text", "hi"], ["updated_at", Tue, 30 Jul 2013 16:48:19 UTC +00:00]]
---
    def create
      @message = current_room.messages.new(params[:message])
      @message.author = current_user

      respond_to do |format|
        if @message.save