app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "name", "owner_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 30 Jul 2013 16:39:55 UTC +00:00], ["name", "Financial"], ["owner_id", nil], ["updated_at", Tue, 30 Jul 2013 16:39:55 UTC +00:00]]
---
    def create
      @room = Room.new(params[:room][:memberships])

      respond_to do |format|
        if @room.save