app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
	def destroy
	  User.find(params[:id].destroy)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = 1 ORDER BY articles.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = 1
---
	def show
	  @user = User.find(params[:id])
	  @articles = @user.articles.paginate(page: params[:page])